# **<font color='crimson'>Relational Model</font>**

---

# **1.1 Relations**

---

In [ ]:
###

In [ ]:
CREATE TABLE book(
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8, 2),
    amount INT
);

In [ ]:
###

In [ ]:
INSERT INTO book (title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);

In [ ]:
###

In [ ]:
INSERT INTO book (title, author, price, amount)
VALUES
    ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
    ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
    ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);

# **1.2 Data Sampling**

---

In [ ]:
###

In [ ]:
SELECT *
FROM book;

In [ ]:
###

In [ ]:
SELECT
    author,
    title,
    price
FROM book;

In [ ]:
###

In [ ]:
SELECT
    title AS Название,
    author AS Автор
FROM book;

In [ ]:
###

In [ ]:
SELECT
     title,
     amount,
     amount * 1.65 AS pack
FROM book;

In [ ]:
###

In [ ]:
SELECT
    title,
    author,
    amount,
    ROUND(price * 0.7, 2) AS new_price
FROM book;

In [ ]:
###

In [ ]:
SELECT
    author,
    title,
    ROUND(IF
      (author = 'Булгаков М.А.', price * 1.1,
      IF
      (author = 'Есенин С.А.', price * 1.05, price)), 2)
      AS new_price
FROM book;

In [ ]:
###

In [ ]:
SELECT
    author,
    title,
    price
FROM book
WHERE amount < 10;

In [ ]:
###

In [ ]:
SELECT
    title,
    author,
    price,
    amount
FROM book
WHERE (price < 500 OR price > 600) AND (price * amount > 5000);

In [ ]:
###

In [ ]:
SELECT
    title,
    author
FROM book
WHERE (price BETWEEN 540.5 AND 800) AND amount IN (2, 3, 5, 7);

In [ ]:
###

In [ ]:
SELECT
    author,
    title
FROM book
WHERE amount BETWEEN 2 AND 14
ORDER BY author DESC, title;

In [ ]:
###

In [ ]:
SELECT
    title,
    author
FROM book
WHERE (title NOT LIKE ' ') AND (title LIKE '% %') AND (author LIKE '% С._.' OR author LIKE '% _.С.')
ORDER BY title;

In [ ]:
###

In [ ]:
SELECT
    author AS 'Автор',
    title AS 'Название',
    amount AS 'Продано',
    amount * price AS 'Выручка'
FROM book
WHERE amount > 5
ORDER BY amount * price DESC;

# **1.3 Queries and Group Operations**

---

In [ ]:
###

In [ ]:
SELECT
    DISTINCT amount
FROM book;

In [ ]:
###

In [ ]:
SELECT
    author AS 'Автор',
    COUNT(DISTINCT title) AS 'Различных_книг',
    SUM(amount) AS 'Количество_экземпляров'
FROM book
GROUP BY author;

In [ ]:
###

In [ ]:
SELECT
    author,
    MIN(price) AS 'Минимальная_цена',
    MAX(price) AS 'Максимальная_цена',
    AVG(price) AS 'Средняя_цена'
FROM book
GROUP BY author;

In [ ]:
###

In [ ]:
SELECT
    author,
    SUM(price * amount) AS 'Стоимость',
    ROUND(
      SUM(((price * amount) * (18 / 100)) / (1 + 18 / 100)), 2) AS 'НДС',
    ROUND(
      SUM((price * amount)  / (1 + 18 / 100)), 2) AS 'Стоимость_без_НДС'
FROM book
GROUP BY author;

In [ ]:
###

In [ ]:
SELECT
    MIN(price) AS 'Минимальная_цена',
    MAX(price) AS 'Максимальная_цена',
    ROUND(AVG(price), 2) AS 'Средняя_цена'
FROM book;

In [ ]:
###

In [ ]:
SELECT
    ROUND(AVG(price), 2) AS Средняя_цена,
    SUM(price * amount) AS Стоимость
FROM book
WHERE amount BETWEEN 5 AND 14;

In [ ]:
###

In [ ]:
SELECT
    author,
    SUM(price * amount) AS Стоимость
FROM book
WHERE title NOT IN ('Идиот', 'Белая гвардия')
GROUP BY author
HAVING SUM(price * amount) > 5000
ORDER BY Стоимость DESC;

In [ ]:
###

In [ ]:
SELECT
    author,
    SUM(amount) AS Число_экземпляров,
    ROUND(AVG(price), 2) AS Средняя_цена
FROM book
WHERE amount > 1
GROUP BY author
HAVING SUM(price * amount) > 5000
ORDER BY author;

# **1.4 Nested Queries**

---

In [ ]:
###

In [ ]:
SELECT
    author,
    title,
    price
FROM book
WHERE price <= (
    SELECT AVG(PRICE)
    FROM book
)
ORDER BY price DESC;

In [ ]:
###

In [ ]:
SELECT
    author,
    title,
    price
FROM book
WHERE price - (
    SELECT MIN(price)
    FROM book) <= 150
ORDER BY price ASC;

In [ ]:
###

In [ ]:
SELECT
    author, title, amount
FROM book
WHERE amount IN (
SELECT
    amount
FROM book
GROUP BY amount
HAVING COUNT(amount) = 1);

In [ ]:
###

In [ ]:
SELECT
    author,
    title,
    price
FROM book
WHERE price < ANY (
    SELECT
        MIN(price)
    FROM book
    GROUP BY author);

In [ ]:
###

In [ ]:
SELECT
    title,
    author,
    amount,
    (SELECT MAX(amount) FROM book) - amount AS Заказ
FROM book
WHERE amount <> (SELECT MAX(amount) FROM book);

In [ ]:
###

In [ ]:
/*определить стоимость покупки,
если купить самую дешевую книгу каждого автора*/

SELECT
    SUM(price)
FROM book
WHERE price IN (
    SELECT
        MIN(price)
    FROM book
    GROUP BY author);

# **1.5 Data Correction Requests**

---

In [ ]:
###

In [ ]:
CREATE TABLE supply(
    supply_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8, 2),
    amount INT
)

In [ ]:
###

In [ ]:
INSERT INTO supply (title, author, price, amount)
VALUES
    ('Лирика', 'Пастернак Б.Л.', 518.99, 2),
    ('Черный человек', 'Есенин С.А.', 570.20, 6),
    ('Белая гвардия', 'Булгаков М.А.', 540.50, 7),
    ('Идиот', 'Достоевский Ф.М.', 360.80, 3);

In [ ]:
###

In [ ]:
INSERT INTO book (title, author, price, amount)
SELECT
    title,
    author,
    price,
    amount
FROM supply
WHERE author NOT IN (
    'Булгаков М.А.', 'Достоевский Ф.М.');

In [ ]:
###

In [ ]:
INSERT INTO book (title, author, price, amount)
SELECT
    title,
    author,
    price,
    amount
FROM supply
WHERE author NOT IN (
    SELECT author
    FROM book);
SELECT * FROM book;

In [ ]:
###

In [ ]:
UPDATE book
SET price = price * 0.9
WHERE amount IN (5, 6, 7, 8, 9, 10);

In [ ]:
###

In [ ]:
UPDATE book
SET
    buy = IF(buy > amount, amount, buy),
    price = IF(buy = 0, price * 0.9, price);
SELECT * FROM book;

In [ ]:
###

In [ ]:
UPDATE book, supply
SET
    book.amount = book.amount + supply.amount,
    book.price = (book.price + supply.price) / 2
WHERE
    book.title = supply.title AND book.author = supply.author;
SELECT * FROM book;

In [ ]:
###

In [ ]:
DELETE FROM supply
WHERE author IN (
    SELECT author
    FROM book
    GROUP BY author
    HAVING SUM(amount) > 10);

In [ ]:
###

In [ ]:
CREATE TABLE ordering AS
SELECT
    author,
    title,
    (SELECT ROUND(AVG(amount), 2)
     FROM book) AS amount
FROM book
WHERE book.amount < (SELECT AVG(amount)
               FROM book);

In [ ]:
###

Создать новую таблицу ordering, в которую занести из таблицы book книги, количество которых больше среднего количества в таблице book, при этом сделать на эти книги скидку в 30%, а в названии добавить "SALE 30%: ".
Например, "SALE 30%: Мастер и Маргарита".

In [ ]:
CREATE TABLE ordering AS
SELECT
    author,
    CONCAT('Sale 30%: ', title) AS title,
    ROUND(price * 0.7, 2) AS price,
    amount
FROM book
WHERE amount > (
    SELECT AVG(amount)
    FROM book);

# **1.6 Selection Requests**

---

In [ ]:
###

In [ ]:
SELECT
    name,
    city,
    per_diem,
    date_first,
    date_last
FROM trip
WHERE name LIKE '%а _._.'
ORDER BY date_last DESC;

In [ ]:
###

In [ ]:
SELECT
    DISTINCT name
FROM trip
WHERE city = 'Москва'
ORDER BY name ASC;

In [ ]:
###

In [ ]:
SELECT
    city,
    COUNT(name) AS Количество
FROM trip
GROUP BY city
ORDER BY city ASC;

In [ ]:
###

In [ ]:
SELECT
    city,
    COUNT(name) AS Количество
FROM trip
GROUP BY city
ORDER BY Количество DESC
LIMIT 2;

In [ ]:
###

In [ ]:
SELECT
    name,
    city,
    DATEDIFF(date_last, date_first) + 1 AS Длительность
FROM trip
WHERE city NOT IN ('Москва', 'Санкт-Петербург')
ORDER BY Длительность DESC, city DESC;

In [ ]:
###

In [ ]:
SELECT
    name,
    city,
    date_first,
    date_last
FROM trip
WHERE DATEDIFF(date_last, date_first) IN (
    SELECT MIN(DATEDIFF(date_last, date_first))
    FROM trip);

In [ ]:
###

In [ ]:
SELECT
    name,
    city,
    date_first,
    date_last
FROM trip
WHERE MONTH(date_first) = MONTH(date_last)
ORDER BY city ASC, name ASC;

In [ ]:
###

In [ ]:
SELECT
    MONTHNAME(date_first) AS Месяц,
    COUNT(name) AS Количество
FROM trip
GROUP BY MONTHNAME(date_first)
ORDER BY
    COUNT(name) DESC,
    MONTHNAME(date_first) ASC;

In [ ]:
###

In [ ]:
SELECT
    name,
    city,
    date_first,
    per_diem * (DATEDIFF(date_last, date_first) + 1) AS Сумма
FROM trip
WHERE MONTH(date_first) IN (2, 3)
ORDER BY name ASC, Сумма DESC;

In [ ]:
###

In [ ]:
SELECT
    name,
    SUM(per_diem * (DATEDIFF(date_last, date_first) + 1)) AS Сумма
FROM trip
GROUP BY name
HAVING COUNT(name) > 3
ORDER BY Сумма DESC;

# **1.7 Adjustment Requests**

---

In [ ]:
###

In [ ]:
CREATE TABLE fine(
    fine_id INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(30),
    number_plate VARCHAR(6),
    violation VARCHAR(50),
    sum_fine DECIMAL(8, 2),
    date_violation DATE,
    date_payment DATE
);

In [ ]:
###

In [ ]:
INSERT INTO fine (
    name, number_plate, violation,
    sum_fine, date_violation, date_payment)
VALUES
    ('Баранов П.Е.', 'Р523ВТ',
     'Превышение скорости(от 40 до 60)', NULL, '2020-02-14', NULL),
    ('Абрамова К.А.', 'О111АВ',
     'Проезд на запрещающий сигнал', NULL, '2020-02-23', NULL),
    ('Яковлев Г.Р.', 'Т330ТТ',
     'Проезд на запрещающий сигнал', NULL, '2020-03-03', NULL);

In [ ]:
###

In [ ]:
UPDATE fine AS f, traffic_violation AS tv
SET
    f.sum_fine = IF(f.sum_fine IS NULL,
       tv.sum_fine, f.sum_fine)
WHERE f.violation = tv.violation;
SELECT * FROM fine;

In [ ]:
UPDATE fine AS f, traffic_violation AS tv
SET
    f.sum_fine = tv.sum_fine
WHERE
    tv.violation = f.violation and f.sum_fine IS Null;

In [ ]:
###

In [ ]:
SELECT
    name,
    number_plate,
    violation
FROM fine
GROUP BY name, number_plate, violation
HAVING COUNT(violation) >= 2
ORDER BY name ASC, number_plate ASC, violation ASC;

In [ ]:
###

In [ ]:
UPDATE fine,
    (SELECT
        name,
        number_plate,
        violation
    FROM fine
    GROUP BY name, number_plate, violation
    HAVING COUNT(violation) >= 2
    ORDER BY name ASC, number_plate ASC, violation ASC
    ) AS temp_table
SET
    fine.sum_fine = fine.sum_fine * 2
WHERE
    fine.name = temp_table.name
    AND fine.number_plate = temp_table.number_plate
    AND fine.violation = temp_table.violation
    AND fine.date_payment IS NULL;
SELECT * FROM fine;

In [ ]:
###

In [ ]:
UPDATE fine, payment
SET
    fine.date_payment = payment.date_payment,
    fine.sum_fine = IF(
        payment.date_payment - fine.date_violation <= 20,
        fine.sum_fine * 0.5,
        fine.sum_fine)
WHERE
    fine.name = payment.name
    AND fine.number_plate = payment.number_plate
    AND fine.violation = payment.violation
    AND fine.date_violation = payment.date_violation;

In [ ]:
###

In [ ]:
CREATE TABLE back_payment AS
SELECT
    name,
    number_plate,
    violation,
    sum_fine,
    date_violation
FROM fine
WHERE date_payment IS NULL;

In [ ]:
###

In [ ]:
DELETE FROM fine
WHERE date_violation < '2020-02-01';